<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002, V02
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Non-Programming Track, HW2, Part 2<br>
</span>
</center></i>

# Introduction

## Environment

- Test environment.


- Set your MySQL user and password below.

In [1]:
mysql_user = "root"
mysql_pw = "dbuserdbuser"

In [2]:
%load_ext sql

In [3]:
full_url = f"mysql+pymysql://{mysql_user}:{mysql_pw}@localhost"
full_url

'mysql+pymysql://root:dbuserdbuser@localhost'

In [4]:
%sql $full_url

In [5]:
%sql select * from db_book.student;

 * mysql+pymysql://root:***@localhost
13 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60')),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98')),
 ('98988', 'Tanaka', 'Biology', Decimal('120'))]

## Submission Instructions

- See Ed for instructions.

# Data and Scheme Cleanup

## characters and name_basics_all

- The task is to "clean up" ```characters``` and produce a table ```charactersFixed```.


- The task will require adding missing rows to ```name_basics_all```. There are two row's in ```characters``` that have an ```actorLink``` and ```actorName``` got which there is no matching row in ```name_basics_all```.


- ```characters``` has two actors with actorNames ```Barry John O'Connor``` and ```Barry O'Connor``` who are the same actor.


- My ```charactersFixed``` has the following columns:
    - ```characterId``` is a generated primary key. See below for an explanation.
    - ```characterName```: The value from ```characters```.
    - ```characterImdbID```: The ```characterLink``` from ```characters``` with ```/character/``` removed.
    - ```characterLink```: The ```characterLink``` from ```characters```.
    - ```actorNConst```: ```actorLink``` from ```characters```.
    - ```actorLink```: A value of the form ```/names/``` followed by the ```actorNConst```.
    - ```characterImageFull```: The value from ```characters```.
    - ```characterImageThumb```: The value from ```characters```.
    - ```kingsguard```: The value from ```characters```.
    - ```royal```: The value from ```characters```.
    
    
- The algorithm for generating the ```characterID``` on insert is the following:
    - The prefix for the ```character``` is either:
        - The substring of ```characterName``` preceeding the first ' '.
        - The ```characterName``` is there is no ' '.
    - If there are ```N``` rows in the table, the number after the prefix is ```N+1```.
    - Implementing this is tricky. Your first attempt might rely on ```auto-increment```, but this does not work. You may also be tempted to count rows, but that does not work. A hint is that you will need to use a trigger and some other table/data that you create.
    
    
- The directory with this notebook containers data from my version of ```charactersFixed```.


- The cells below load the data to allow you to examine. In your SQL table, ```NaN``` will be ```NULL```.

In [6]:
import pandas as pd

In [7]:
characters_df = pd.read_csv('./charactersFixed.csv')

In [8]:
characters_df

,characterId,characterName,characterImdbID,characterLink,actorNconst,actorLink,characterImageFull,characterImageThumb,kingsguard,royal
0,Addam1,Addam Marbrand,ch0305333,/character/ch0305333,nm0389698,/names/nm0389698,NaN,NaN,NaN,NaN
1,Aegon2,Aegon Targaryen,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
2,Aeron3,Aeron Greyjoy,ch0540081,/character/ch0540081,nm0269923,/names/nm0269923,https://images-na.ssl-images-amazon.com/images...,https://images-na.ssl-images-amazon.com/images...,NaN,NaN
3,Aerys4,Aerys II Targaryen,ch0541362,/character/ch0541362,nm0727778,/names/nm0727778,https://images-na.ssl-images-amazon.com/images...,https://images-na.ssl-images-amazon.com/images...,NaN,1.0
4,Akho5,Akho,ch0544520,/character/ch0544520,nm6729880,/names/nm6729880,https://images-na.ssl-images-amazon.com/images...,https://images-na.ssl-images-amazon.com/images...,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
384,Young385,Young Nan,ch0305018,/character/ch0305018,nm1519719,/names/nm1519719,NaN,NaN,NaN,NaN
385,Young386,Young Ned,ch0154681,/character/ch0154681,nm7075019,/names/nm7075019,NaN,NaN,NaN,NaN
386,Young387,Young Ned Stark,ch0154681,/character/ch0154681,nm7509185,/names/nm7509185,NaN,NaN,NaN,NaN
387,Young388,Young Rodrik Cassel,ch0171391,/character/ch0171391,nm7509186,/names/nm7509186,NaN,NaN,NaN,NaN
388,Zanrush389,Zanrush,ch0540870,/character/ch0540870,nm0503319,/names/nm0503319,https://images-na.ssl-images-amazon.com/images...,https://images-na.ssl-images-amazon.com/images...,NaN,NaN

- Your answer below should show all of your SQL statements, including DDL, for creating and loading ```charactersFixed``` as well as changes to ```name_basics_all```.


- You can use the data in the CSV file to test your work. Show at least one test.

In [7]:
%%sql drop schema if exists s23_w4111_hw2_yz4356_clean;

/* SQL statements in this cell. You may use multiple cells. */

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [8]:
%sql create schema s23_w4111_hw2_yz4356_clean;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [9]:
%sql create table s23_w4111_hw2_yz4356_clean.characters as select * from s23_w4111_hw2_yz4356.characters

 * mysql+pymysql://root:***@localhost
389 rows affected.

[]

In [6]:
%%sql
use s23_w4111_hw2_yz4356_clean

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [7]:
%%sql
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify characterName varchar(32) null;
    
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify characterLink varchar(64) null;
    
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify actorLink varchar(16) null;
    
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify characterImageFull varchar(256) null;
    
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify characterImageThumb varchar(256) null;
    
alter table s23_w4111_hw2_yz4356_clean.characters 
    modify kingsguard varchar(8) null;

alter table s23_w4111_hw2_yz4356_clean.characters 
    modify royal varchar(8) null;

 * mysql+pymysql://root:***@localhost
389 rows affected.
389 rows affected.
389 rows affected.
389 rows affected.
389 rows affected.
389 rows affected.
389 rows affected.

[]

In [8]:
%%sql
update s23_w4111_hw2_yz4356_clean.characters
set actorLink='nm3226454',
    characterLink='/character/ch0305319/'
where actorName='Barry O''Connor';

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [11]:
%%sql
drop function if exists comp_characterImdbID;
create function comp_characterImdbID(characterLink varchar(64)) returns varchar(64)
reads sql data
BEGIN
    declare final varchar(64);

    set final=substr(substr(characterLink,1,length(characterLink)-1),12);
    return final;
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
drop function if exists comp_actorLink;
create function comp_actorLink(actorNConst varchar(16)) returns varchar(32)
reads sql data
BEGIN
    declare final varchar(32);

    set final=concat('/names/',actorNConst);
    return final;
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql
drop table if exists s23_w4111_hw2_yz4356_clean.charactersFixed;

create table if not exists s23_w4111_hw2_yz4356_clean.charactersFixed
(
    characterId varchar(16) primary key,
    characterName varchar(32) not null,
    characterImdbID varchar(64) null,
    characterLink varchar(64) null,
    actorNConst varchar(16) null,
    actorLink varchar(32) null,
    characterImageFull varchar(256) null,
    characterImageThumb varchar(256) null,
    kingsguard varchar(8) null,
    royal varchar(8) null
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [9]:
%%sql

drop function if exists comp_charaid;
create function comp_charaid(characterName varchar(32),count int) returns varchar(16)
reads sql data
BEGIN
    declare final varchar(16);
    declare name varchar(16);

    set name=substring_index(characterName,' ', 1);

    set final=concat(name,count);
    return final;
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql

drop trigger if exists compute_characterid;

create trigger compute_characterid
    before insert
    on s23_w4111_hw2_yz4356_clean.charactersFixed
    for each row
begin
    declare count int;

    set count=(select count(*) from s23_w4111_hw2_yz4356_clean.charactersFixed);
    set count=count+1;

    set new.characterId=comp_charaid(new.characterName,count);
end;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [11]:
%%sql
insert into 
charactersFixed(characterName,characterImdbID,characterLink,actorNConst,actorLink,
                characterImageFull,characterImageThumb,kingsguard,royal)
    select characterName,comp_characterImdbID(characterLink),characterLink,
    actorLink,comp_actorLink(actorLink),characterImageFull,characterImageThumb,kingsguard,royal 
    from characters;

 * mysql+pymysql://root:***@localhost
389 rows affected.

[]

In [12]:
%sql select * from s23_w4111_hw2_yz4356_clean.charactersFixed;
/* SQL test to show result. */

 * mysql+pymysql://root:***@localhost
389 rows affected.
0 rows affected.

[]

In [7]:
%sql select * from s23_w4111_hw2_yz4356_clean.charactersFixed limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Addam1', 'Addam Marbrand', 'ch0305333', '/character/ch0305333/', 'nm0389698', '/names/nm0389698', None, None, None, None),
 ('Aegon2', 'Aegon Targaryen', None, None, None, None, None, None, None, '1'),
 ('Aeron3', 'Aeron Greyjoy', 'ch0540081', '/character/ch0540081/', 'nm0269923', '/names/nm0269923', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDg0ZDAtN2Y2ZC00MzU1LTgyYjQtNTBjYjEzODczZDVhXkEyXkFqcGdeQXVyNTg0Nzg4NTE@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNzI5MDg0ZDAtN2Y2ZC00MzU1LTgyYjQtNTBjYjEzODczZDVhXkEyXkFqcGdeQXVyNTg0Nzg4NTE@._V1._SX100_SY140_.jpg', None, None),
 ('Aerys4', 'Aerys II Targaryen', 'ch0541362', '/character/ch0541362/', 'nm0727778', '/names/nm0727778', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMWQzOWViN2ItNDZhOS00MmZlLTkxZTYtZDg5NGUwMGRmYWZjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMWQzOWViN2ItNDZhOS00MmZlLTkxZTYtZDg5NGUwMGRmYWZjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', None, '1'),
 ('Akho5', 'Akho', 'ch0544520', '/character/ch0544520/', 'nm6729880', '/names/nm6729880', 'https://images-na.ssl-images-amazon.com/images/M/MV5BOGE4ZDZmOGUtNGE4Ny00Y2VmLThiOGItMjk3Y2U0ZDY3OWQxXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BOGE4ZDZmOGUtNGE4Ny00Y2VmLThiOGItMjk3Y2U0ZDY3OWQxXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', None, None),
 ('Alliser6', 'Alliser Thorne', 'ch0246938', '/character/ch0246938/', 'nm0853583', '/names/nm0853583', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjExMjA3M15BMl5BanBnXkFtZTcwMjI1ODg5NA@@._V1_SY1000_CR0,0,666,1000_AL_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMjExMjA3M15BMl5BanBnXkFtZTcwMjI1ODg5NA@@._V1._SX100_SY140_.jpg', None, None),
 ('Alton7', 'Alton Lannister', 'ch0305012', '/character/ch0305012/', 'nm0203801', '/names/nm0203801', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU1NTAzOF5BMl5BanBnXkFtZTcwNzA2NDk4OA@@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTU1NTAzOF5BMl5BanBnXkFtZTcwNzA2NDk4OA@@._V1._SX100_SY140_.jpg', None, None),
 ('Alys8', 'Alys Karstark', 'ch0576836', '/character/ch0576836/', 'nm8257864', '/names/nm8257864', None, None, None, None),
 ('Amory9', 'Amory Lorch', 'ch0305002', '/character/ch0305002/', 'nm0571654', '/names/nm0571654', 'https://images-na.ssl-images-amazon.com/images/M/MV5BOTVmY2M2YmUtY2JkYS00NjIyLWFhYTAtNTNlZmI4ODdiNmE5XkEyXkFqcGdeQXVyMjg2MTMyNTM@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BOTVmY2M2YmUtY2JkYS00NjIyLWFhYTAtNTNlZmI4ODdiNmE5XkEyXkFqcGdeQXVyMjg2MTMyNTM@._V1._SX100_SY140_.jpg', None, None),
 ('Anguy10', 'Anguy', 'ch0316930', '/character/ch0316930/', 'nm1528121', '/names/nm1528121', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNmRhY2M4YmItNjc2Yi00ZDc0LWE5NmUtNGE5OWE0YTQ2YjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNmRhY2M4YmItNjc2Yi00ZDc0LWE5NmUtNGE5OWE0YTQ2YjY3XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', None, None),
 ('Archmaester11', 'Archmaester Marwyn', 'ch0578265', '/character/ch0578265/', 'nm0000980', '/names/nm0000980', None, None, None, None),
 ('Areo12', 'Areo Hotah', 'ch0507107', '/character/ch0507107/', 'nm0649046', '/names/nm0649046', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNWFkNTAwNzctOGQ2ZS00OTMyLWE3NDYtOGUwM2E1MzVlYjI0XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BNWFkNTAwNzctOGQ2ZS00OTMyLWE3NDYtOGUwM2E1MzVlYjI0XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', None, None),
 ('Armeca13', 'Armeca', 'ch0305014', '/character/ch0305014/', 'nm1783582', '/names/nm1783582', 'https://images-na.ssl-images-amazon.com/images/M/MV5BZmQyMGVlMDctYWFhMi00YzMyLTlkZDgtOWNmZTY3NmZkYzZlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BZmQyMGVlMDctYWFhMi00YzMyLTlkZDgtOWNmZTY3NmZkYzZlXkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', None, None),
 ('Arthur14', 'Arthur', 'ch0305326', '/character/ch0305326/', 'nm8127149', '/names/nm8127149', None, None, None, None),
 ('Arthur15', 'Arthur Dayne', 'ch0540097', '/character/ch0540097/', 'nm1074361', '/names/nm1074361', 'https://images-na.ssl-images-amazon.com/images/M/MV5BODczZDUxYmQtMzk1MC00ZTUwLTk1MjAtZDJlODViMWFhOGU5XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BODczZDUxYmQtMzk1MC00ZTUwLTk1MjAtZDJlODViMWFhOGU5XkEyXkFqcGdeQXVyMjk3NTUyOTc@._V1._SX100_SY140_.jpg', '1', None),
 ('Arya16', 'Arya Stark', 'ch0158604', '/character/ch0158604/', 'nm3586035', '/names/nm3586035', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTYwNDc0OF5BMl5BanBnXkFtZTcwOTg2NDg1Nw@@._V1_SY1000_CR0,0,665,1000_AL_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTYwNDc0OF5BMl5BanBnXkFtZTcwOTg2NDg1Nw@@._V1._SX100_SY140_.jpg', None, None),
 ('Baby17', 'Baby Sam', 'ch0547881', '/character/ch0547881/', None, None, None, None, None, None),
 ('Balon18', 'Balon Greyjoy', 'ch0292152', '/character/ch0292152/', 'nm0538869', '/names/nm0538869', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjkwODczN15BMl5BanBnXkFtZTcwODMwNTgzNw@@._V1_SY1000_CR0,0,637,1000_AL_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjkwODczN15BMl5BanBnXkFtZTcwODMwNTgzNw@@._V1._SX100_SY140_.jpg', None, None),
 ('Baratheon19', 'Baratheon Guard', 'ch0350989', '/character/ch0350989/', 'nm4207240', '/names/nm4207240', None, None, None, None),
 ('Barristan20', 'Barristan Selmy', 'ch0241346', '/character/ch0241346/', 'nm0568400', '/names/nm0568400', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTE0NjUxNV5BMl5BanBnXkFtZTcwOTA1ODg5NA@@._V1_SX1500_CR0,0,1500,999_AL_.jpg', 'https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTE0NjUxNV5BMl5BanBnXkFtZTcwOTA1ODg5NA@@._V1._SX100_SY140_.jpg', None, None)]

output screenshot


<img src="./output1.png">

<img src="./outpu2.png">

<img src="./output3.png">

## name_basics_all

- The column ```primaryProfessions``` is multi-valued and non-atomic. This violates good relational design principle.


- Create a new table ```name_basics_all_fixed``` which does not have the column ```primaryProfessions```.


- You will need to use SQL to create and load other tables with information from ```name_basics_all``` to enable you to create a view ```name_basics_all_fixed_view``` that recreates the data in ```name_basics_all```. The tables you create should have atomic columns, primary keys and foreign keys, etc.

In [5]:
%sql create table s23_w4111_hw2_yz4356_clean.name_basics as select * from s23_w4111_hw2_yz4356.name_basics

 * mysql+pymysql://root:***@localhost
730 rows affected.

[]

In [6]:
%%sql 
create table s23_w4111_hw2_yz4356_clean.name_basics_all as select * from s23_w4111_hw2_yz4356_new.name_basics_all

 * mysql+pymysql://root:***@localhost
348 rows affected.

[]

In [9]:
%%sql
insert into name_basics_all(nconst,primaryName)
select actorLink,actorName
from characters where actorLink not in
                      (select nconst from name_basics_all);

/* Use this cell and others to create tables, load data, etc. */

 * mysql+pymysql://root:***@localhost
3 rows affected.
0 rows affected.

[]

In [10]:
%%sql
delete
from name_basics_all
where primaryName='Barry O''Connor';

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [11]:
%%sql

alter table name_basics_all
    modify nconst varchar(16) null;
    
alter table name_basics_all
    modify primaryName varchar(32) null;

alter table name_basics_all
    modify birthYear varchar(4) null;

alter table name_basics_all
    modify deathYear varchar(4) null;

alter table name_basics_all
    modify primaryProfession varchar(64) null;

alter table name_basics_all
    modify knownForTitles varchar(64) null;

select count(nconst)as no_nconst, count(distinct nconst)as no_dis_nconst
from name_basics_all;

alter table name_basics_all
    add constraint name_basics_all_pk
        primary key (nconst);

 * mysql+pymysql://root:***@localhost
0 rows affected.
350 rows affected.
350 rows affected.
350 rows affected.
350 rows affected.
350 rows affected.
1 rows affected.
0 rows affected.

[]

In [12]:
%%sql
create table s23_w4111_hw2_yz4356_clean.name_basics_all_fixed
    select nconst,primaryName,birthYear,deathYear,knownForTitles from name_basics_all;

alter table name_basics_all_fixed
    add constraint name_basics_all_fixed_pk
    primary key (nconst);

 * mysql+pymysql://root:***@localhost
350 rows affected.
0 rows affected.

[]

In [9]:
%%sql
with one as (
    select primaryProfession,replace(primaryProfession,',','') as no_comma
    from name_basics_all
)
select length(primaryProfession)-length(no_comma)+1 as no_profession
from one
order by no_profession desc
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,), (3,)]

In [13]:
%%sql
with one as (
    select primaryProfession,
           substr(primaryProfession,1,locate(',',primaryProfession)-1) as p1,
           substr(primaryProfession,locate(',',primaryProfession)+1) as p2
    from name_basics_all
),
    two as (
        select primaryProfession,p1,
               substr(p2,1,locate(',',p2)-1) as p2,
               substr(p2,locate(',',p2)+1) as p3
        from one
    ),
    three as (
    select p1 from two
    union
    select p2 from two
    union
    select p3 from two
    )
select * from three where p1!='';

 * mysql+pymysql://root:***@localhost
28 rows affected.

[('actor',),
 ('actress',),
 ('writer',),
 ('assistant_director',),
 ('stunts',),
 ('casting_director',),
 ('soundtrack',),
 ('talent_agent',),
 ('miscellaneous',),
 ('art_department',),
 ('casting_department',),
 ('producer',),
 ('director',),
 ('sound_department',),
 ('composer',),
 ('music_department',),
 ('transportation_department',),
 ('editor',),
 ('visual_effects',),
 ('costume_department',),
 ('animation_department',),
 ('cinematographer',),
 ('script_department',),
 ('production_manager',),
 ('executive',),
 ('camera_department',),
 ('make_up_department',),
 ('set_decorator',)]

In [14]:
%%sql
create table s23_w4111_hw2_yz4356_clean.profession_values as with one as (
    select primaryProfession,
           substr(primaryProfession,1,locate(',',primaryProfession)-1) as p1,
           substr(primaryProfession,locate(',',primaryProfession)+1) as p2
    from name_basics_all
),
    two as (
        select primaryProfession,p1,
               substr(p2,1,locate(',',p2)-1) as p2,
               substr(p2,locate(',',p2)+1) as p3
        from one
    ),
    three as (
    select p1 from two
    union
    select p2 from two
    union
    select p3 from two
    )
select p1 as professionName from three where p1!='';

 * mysql+pymysql://root:***@localhost
28 rows affected.

[]

In [15]:
%%sql
alter table profession_values
    modify professionName varchar(32) not null;

alter table profession_values
add constraint profession_values_pk
primary key (professionName);

 * mysql+pymysql://root:***@localhost
28 rows affected.
0 rows affected.

[]

In [8]:
%%sql
with one as (
    select nconst,primaryProfession,
           substr(primaryProfession,1,locate(',',primaryProfession)-1) as p1,
           substr(primaryProfession,locate(',',primaryProfession)+1) as p2
    from name_basics_all
),
    two as (
        select nconst,primaryProfession,p1,
               substr(p2,1,locate(',',p2)-1) as p2,
               substr(p2,locate(',',p2)+1) as p3
        from one
    ),
    three as (
    select nconst,p1 as profession from two where p1 !=''
    union
    select nconst,p2 as profession from two where p2 !=''
    union
    select nconst,p3 as profession from two where p3 !=''
    )
select * from three
limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('nm0000293', 'actor'),
 ('nm0000596', 'actor'),
 ('nm0000980', 'actor'),
 ('nm0001097', 'actor'),
 ('nm0001290', 'actor'),
 ('nm0001354', 'actor'),
 ('nm0001671', 'actress'),
 ('nm0002103', 'actor'),
 ('nm0004355', 'actor'),
 ('nm0004692', 'actor'),
 ('nm0015382', 'actor'),
 ('nm0019885', 'actor'),
 ('nm0050520', 'actor'),
 ('nm0050959', 'actor'),
 ('nm0064155', 'actor'),
 ('nm0103195', 'actor'),
 ('nm0119804', 'actress'),
 ('nm0130538', 'actor'),
 ('nm0162281', 'actor'),
 ('nm0174005', 'actor')]

In [17]:
%%sql
create table actor_prof as
    with one as (
    select nconst,primaryProfession,
           substr(primaryProfession,1,locate(',',primaryProfession)-1) as p1,
           substr(primaryProfession,locate(',',primaryProfession)+1) as p2
    from name_basics_all
),
    two as (
        select nconst,primaryProfession,p1,
               substr(p2,1,locate(',',p2)-1) as p2,
               substr(p2,locate(',',p2)+1) as p3
        from one
    ),
    three as (
    select nconst,p1 as profession from two where p1 !=''
    union
    select nconst,p2 as profession from two where p2 !=''
    union
    select nconst,p3 as profession from two where p3 !=''
    )
select * from three;

 * mysql+pymysql://root:***@localhost
610 rows affected.

[]

In [18]:
%%sql
alter table actor_prof
    modify profession varchar(32) not null;

alter table actor_prof
    add constraint actor_prof_pk
        primary key (nconst,profession);

alter table actor_prof
add constraint actor_prof_con_fk
foreign key (nconst) references name_basics_all_fixed(nconst);

alter table actor_prof
add constraint actor_prof_pro_fk
foreign key (profession) references profession_values(professionName);

 * mysql+pymysql://root:***@localhost
610 rows affected.
0 rows affected.
610 rows affected.
610 rows affected.

[]

In [22]:
%%sql
create view name_basics_all_fixed_view as
(with one as (select nconst, group_concat(profession Separator ',') as primaryProfession
             from actor_prof
             group by nconst)
select name_basics_all_fixed.nconst, primaryName,birthYear,deathYear,primaryProfession,knownForTitles
from one right outer join name_basics_all_fixed on(one.nconst=name_basics_all_fixed.nconst));

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [9]:
%%sql
select * from name_basics_all_fixed_view limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('nm0000293', 'Sean Bean', '1959', None, 'actor,animation_department,producer', 'tt0120737,tt0167261,tt0944947,tt1181791'),
 ('nm0000596', 'Jonathan Pryce', '1947', None, 'actor,producer,soundtrack', 'tt0104348,tt8404614,tt0120347,tt3750872'),
 ('nm0000980', 'Jim Broadbent', '1949', None, 'actor,soundtrack,writer', 'tt0203009,tt1431181,tt1007029,tt0217505'),
 ('nm0001097', 'Charles Dance', '1946', None, 'actor,director,writer', 'tt0944947,tt0107362,tt2084970,tt0280707'),
 ('nm0001290', 'Richard E. Grant', '1957', None, 'actor,director,soundtrack', 'tt4595882,tt0280707,tt0102070,tt0094336'),
 ('nm0001354', 'CiarÃ¡n Hinds', '1953', None, 'actor,soundtrack', 'tt1340800,tt1596365,tt1201607,tt12789558'),
 ('nm0001671', 'Diana Rigg', '1938', '2020', 'actress,costume_department,soundtrack', 'tt0054518,tt9639470,tt0064757,tt0944947'),
 ('nm0002103', 'Julian Glover', '1935', None, 'actor,soundtrack', 'tt0082398,tt0332452,tt0080684,tt0097576'),
 ('nm0004355', 'Roger Ashton-Griffiths', '1957', None, 'actor,director,writer', 'tt0088846,tt0944947,tt4575576,tt0217505'),
 ('nm0004692', 'Mark Addy', '1964', None, 'actor,soundtrack', 'tt0944947,tt0955308,tt0119164,tt0183790'),
 ('nm0015382', 'Adewale Akinnuoye-Agbaje', '1967', None, 'actor,director,writer', 'tt1127881'),
 ('nm0019885', 'Roger Allam', '1953', None, 'actor,soundtrack', 'tt1486190,tt0811080,tt0434409,tt1298650'),
 ('nm0050520', 'Peter Ballance', None, None, 'actor,miscellaneous', 'tt0408056,tt0944947,tt0323033,tt1985443'),
 ('nm0050959', 'Pedro Pascal', '1975', None, 'actor,producer,soundtrack', 'tt4649466,tt7126948,tt0944947,tt8111088'),
 ('nm0057965', 'Clifford Barry', None, None, 'actor', 'tt0118363,tt0944947,tt0094535,tt0189192'),
 ('nm0064155', 'Ian Beattie', '1965', None, 'actor,director,writer', 'tt2303687,tt0944947,tt0346491,tt2567712'),
 ('nm0065874', 'Andy Beckwith', None, None, 'actor', 'tt5691024,tt0208092,tt1355631,tt0944947'),
 ('nm0072855', 'Paul Bentley', None, None, 'actor', 'tt8697870,tt0944947,tt0185906,tt1007029'),
 ('nm0087432', 'Nicholas Blane', None, None, 'actor', 'tt2343137,tt0443543,tt0373889,tt0944947'),
 ('nm0103195', 'David Bradley', '1942', None, 'actor,soundtrack', 'tt1213663,tt0241527,tt1201607,tt0425112')]